In [6]:
import pandas as pd

create a Pandas data fream
create a manul

In [14]:
mydata = { "RollNo":[101,102,103,104,105],"Sub-1 Marks":[68,78,91]}

In [15]:
print(type(mydata))
print(mydata)
keys= mydata.keys()
value=mydata.values()
print(keys)
print(value)
print(mydata.items())

<class 'dict'>
{'RollNo': [101, 102, 103, 104, 105], 'Sub-1 Marks': [68, 78, 91]}
dict_keys(['RollNo', 'Sub-1 Marks'])
dict_values([[101, 102, 103, 104, 105], [68, 78, 91]])
dict_items([('RollNo', [101, 102, 103, 104, 105]), ('Sub-1 Marks', [68, 78, 91])])

In [16]:
df = pd.DataFrame()

In [17]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [18]:
df1 = pd.DataFrame(mydata)

ValueError: All arrays must be of the same length

In [19]:
mydata = { "RollNo":[101,102,103,104,105],"Sub-1 Marks":[68,78,91,53,23]}

In [20]:
df1 = pd.DataFrame(mydata)

In [21]:
print(df1)

   RollNo  Sub-1 Marks
0     101           68
1     102           78
2     103           91
3     104           53
4     105           23

In [7]:
Student= {
    "Name":["Parikshit","Zaran","Darshan","Maulik","Mahir"],
    "RollNum":[101,102,103,104,105],
    "Subject":["DBMS","Paython","Dc","Java","Other"],
    "Marks" : [56,23,28,47,60],
    "Result": ["Pass","fil","fil","Pass","fil"]
}

In [8]:
df2 = pd.DataFrame(Student)
print(df2)

        Name  RollNum  Subject  Marks Result
0  Parikshit      101     DBMS     56   Pass
1      Zaran      102  Paython     23    fil
2    Darshan      103       Dc     28    fil
3     Maulik      104     Java     47   Pass
4      Mahir      105    Other     60    fil

In [5]:
df2

NameError: name 'df2' is not defined

In [9]:
df2.head() # frist five only display
df2.head(2) # it is last index to display

df2.tail() #last five only display

        Name  RollNum  Subject  Marks Result
0  Parikshit      101     DBMS     56   Pass
1      Zaran      102  Paython     23    fil
2    Darshan      103       Dc     28    fil
3     Maulik      104     Java     47   Pass
4      Mahir      105    Other     60    fil

In [10]:
df2.columns

Index(['Name', 'RollNum', 'Subject', 'Marks', 'Result'], dtype='object')

In [11]:
df2.values #give a numpy array

array([['Parikshit', 101, 'DBMS', 56, 'Pass'],
       ['Zaran', 102, 'Paython', 23, 'fil'],
       ['Darshan', 103, 'Dc', 28, 'fil'],
       ['Maulik', 104, 'Java', 47, 'Pass'],
       ['Mahir', 105, 'Other', 60, 'fil']], dtype=object)

In [13]:
df2['Name']

0    Parikshit
1        Zaran
2      Darshan
3       Maulik
4        Mahir
Name: Name, dtype: object

In [24]:
a=df1.values #give a numpy array
print(a)
print(type(a))
df1.columns

[[101  68]
 [102  78]
 [103  91]
 [104  53]
 [105  23]]
<class 'numpy.ndarray'>

Index(['RollNo', 'Sub-1 Marks'], dtype='object')

In [25]:
df1['Sub-1 Marks'].sum()

313

In [27]:
df1['Sub-2 Marks'] = [23,56,28,30,10]

In [28]:
df1

   RollNo  Sub-1 Marks  Sub-2 Marks
0     101           68           23
1     102           78           56
2     103           91           28
3     104           53           30
4     105           23           10

In [29]:
df1['Total'] = df1['Sub-1 Marks']+ df1['Sub-2 Marks']
df1

   RollNo  Sub-1 Marks  Sub-2 Marks  Total
0     101           68           23     91
1     102           78           56    134
2     103           91           28    119
3     104           53           30     83
4     105           23           10     33

In [35]:
df1['Total Parsentege'] = (df1['Total']*100/200)%100

In [39]:
df.dtype

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [36]:
df1

   RollNo  Sub-1 Marks  Sub-2 Marks  Total  Total Parsentege
0     101           68           23     91              45.5
1     102           78           56    134              67.0
2     103           91           28    119              59.5
3     104           53           30     83              41.5
4     105           23           10     33              16.5

In [40]:
f = pd.DataFrame({'angles':[0,3,4],
                  'degrees':[360,180,360]},index=['cricle','triangle','rectangle'])

In [41]:
f

           angles  degrees
cricle          0      360
triangle        3      180
rectangle       4      360

In [57]:
df3 = pd.read_csv('test.csv')

In [58]:
df3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [59]:
df3.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [60]:
df3.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [61]:
df3.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [62]:
df3.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [63]:
df4 = pd.read_csv('http://bit.ly/kaggletrain')

In [64]:
df4

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [68]:
df4.size

10692

In [69]:
df4.shape

(891, 12)

In [70]:
df4.ndim

2

In [77]:
sum = df4['Age'].sum()
print(sum)

21205.17

In [80]:
averg = df4['Age'].sum()/df4.shape[0]
print(averg)

23.79929292929293

In [82]:
mean = df4['Age'].mean()
print(mean)

29.69911764705882

In [88]:
unice = df4['Sex'].unique()
print(unice)
#unice

['male' 'female']

In [90]:
unice = df4['Pclass'].unique()

#print(unice)

In [95]:
sexmf = df4[df4['Sex'] == 'male']
//print(sexmf)

     PassengerId  Survived  Pclass                            Name   Sex  \
0              1         0       3         Braund, Mr. Owen Harris  male
4              5         0       3        Allen, Mr. William Henry  male
5              6         0       3                Moran, Mr. James  male
6              7         0       1         McCarthy, Mr. Timothy J  male
7              8         0       3  Palsson, Master. Gosta Leonard  male
..           ...       ...     ...                             ...   ...
883          884         0       2   Banfield, Mr. Frederick James  male
884          885         0       3          Sutehall, Mr. Henry Jr  male
886          887         0       2           Montvila, Rev. Juozas  male
889          890         1       1           Behr, Mr. Karl Howell  male
890          891         0       3             Dooley, Mr. Patrick  male

      Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    22.0      1      0         A/5 21171   7.2500   NaN        S
4    35.0      0      0            373450   8.0500   NaN        S
5     NaN      0      0            330877   8.4583   NaN        Q
6    54.0      0      0             17463  51.8625   E46        S
7     2.0      3      1            349909  21.0750   NaN        S
..    ...    ...    ...               ...      ...   ...      ...
883  28.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
886  27.0      0      0            211536  13.0000   NaN        S
889  26.0      0      0            111369  30.0000  C148        C
890  32.0      0      0            370376   7.7500   NaN        Q

[577 rows x 12 columns]

In [97]:
class1=df4[df4['Pclass']==1]
class2=df4[df4['Pclass']==2]
class3=df4[df4['Pclass']==3]

In [101]:
#print(class1)
class1.shape

(216, 12)

In [103]:
#print(class2)
class2.shape

(184, 12)

In [104]:
#print(class3)
class2.shape

(184, 12)

In [105]:
df4['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [106]:
df4['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [107]:
df4.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [108]:
df4['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64